Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.ExactElements Property
 Gets or sets the exact elements of the spacing.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<RebarSpacing.ExactSpacing.Element> ExactElements { get; set; }
Public Property ExactElements As List(Of RebarSpacing.ExactSpacing.Element)
	Get
	Set
Property Value
Type: List<RebarSpacing.ExactSpacing.Element>
See Also
Reference
RebarSpacing Class
Tekla.Structures.Model Namespace